Tekla Open API Reference for Tekla Structures 2025
LogicalWeld.GetMainWeld Method
 Returns the main weld of the logical weld.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BaseWeld GetMainWeld()
Public Function GetMainWeld As BaseWeld
Return Value
Type: BaseWeld
The main weld of the logical weld.
See Also
Reference
LogicalWeld Class
Tekla.Structures.Model Namespace